/*******************************************************************************
* ÊµÑéÃû			   :ÎÂ¶ÈÏÔÊ¾ÊµÑé
* Ê¹ÓÃµÄIO	     : 
* ÊµÑéĞ§¹û       :1602ÏÔÊ¾ÎÂ¶È
*	×¢Òâ					 £º
*******************************************************************************/

#include <reg51.h>
#include "lcd12864.h"
#include "ds18b20.h"
#include "com.h"

uchar CNCHAR[6] = "ÉãÊÏ¶È";

/*******************************************************************************
* º¯ÊıÃû         : tempshow
* º¯Êı¹¦ÄÜ		   : ÔÚÖ÷º¯ÊıÀïÏÔÊ¾ÎÂ¶È
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void tempshow()
{
	LCD12864_ShowString(3,0,"ÎÂ¶È:");
	temp(Ds18b20ReadTemp());
}

/*******************************************************************************
* º¯ÊıÃû         : temp
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* ÊäÈë           : v
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void temp(int temp) 	 //lcdÏÔÊ¾
{
  	unsigned char i, datas[] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
		SBUF='-';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
	    LCD12864_WriteData('-');  		//ÏÔÊ¾¸º
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{			
	    LCD12864_WriteData('+'); 		//ÏÔÊ¾Õı
		SBUF='+';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
	datas[3] = temp % 100 / 10;
	datas[4] = temp % 10;

	LCD12864_WriteData('0'+datas[0]); //°ÙÎ» 
	SBUF = '0'+datas[0];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	
	LCD12864_WriteData('0'+datas[1]); //Ê®Î»
	SBUF = '0'+datas[1];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LCD12864_WriteData('0'+datas[2]); //¸öÎ» 
	SBUF = '0'+datas[2];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LCD12864_WriteData('.'); 		//ÏÔÊ¾ ¡®.¡¯
	SBUF = '.';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	//LCD12864_SetWindow(3,7);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LCD12864_WriteData('0'+datas[3]); //ÏÔÊ¾Ğ¡Êıµã  
	SBUF = '0'+datas[3];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LCD12864_WriteData('0'+datas[4]); //ÏÔÊ¾Ğ¡Êıµã 
	SBUF = '0'+datas[4];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	for(i=0; i<6; i++)
	{
	 	SBUF = CNCHAR[i];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI = 0;
	}
	LCD12864_WriteData('C'); 
}

/*******************************************************************************
* º¯ Êı Ãû         :UsartConfiguration()
* º¯Êı¹¦ÄÜ		  	 :ÉèÖÃ´®¿Ú
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void UsartConfiguration()
{
	SCON=0X50;			//ÉèÖÃÎª¹¤×÷·½Ê½1
	TMOD=0X20;			//ÉèÖÃ¼ÆÊıÆ÷¹¤×÷·½Ê½2
	PCON=0X80;			//²¨ÌØÂÊ¼Ó±¶
	TH1=0XF3;				//¼ÆÊıÆ÷³õÊ¼ÖµÉèÖÃ£¬×¢Òâ²¨ÌØÂÊÊÇ4800µÄ
	TL1=0XF3;
//	ES=1;						//´ò¿ª½ÓÊÕÖĞ¶Ï
//	EA=1;						//´ò¿ª×ÜÖĞ¶Ï
	TR1=1;					//´ò¿ª¼ÆÊıÆ÷
}
